app/controllers/memos_controller.rb

SELECT * FROM "memos" WHERE ("memos"."category" = 'Work' AND "memos"."sub_category" = 'TEST' AND "memos"."user_id" = '2') ORDER BY category ASC, sub_category ASC, mode ASC, title ASC LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "memos" WHERE ("memos"."category" = 'Rails_Tips' AND "memos"."user_id" = '2')
---
  def list
    # パラメータ
#    @category = params[:id]
    @category = params[:category]
    @sub_category = params[:sub_category]

    # [ session[:memo_mode] ]が空白で無ければ、[ session[:memo_mode] ]を格納
    @mode = session[:memo_mode] unless session[:memo_mode].blank?

    # [ params[:option] ]が空白で無ければ、[ params[:option] ]で上書き
    @mode = params[:option] unless params[:option].blank?

    # [ params[:option] ]が「reset」だったら、[ nil ]で上書き
    @mode = nil if params[:option].to_s == "reset" or ( params[:option].blank? and session[:memo_mode].to_s == "reset" )

    # paramsをsessionに保存
    session[:memo_mode] = params[:option]

    # 検索であれば
    if params[:commit] == "検索" or params[:search_flag] == "on"
      @search_word = params[:search_word]
      @search_type = params[:search_type]

      # メモ検索
      case @search_type
      when "title"
        @all_memos = Memo.paginate( :page => params[:page], :conditions => [ "user_id = :user_id AND title LIKE :search_word", { :user_id => session[:user_id], :search_word => "%#{@search_word}%" } ], :order => "category ASC, sub_category ASC, title ASC", :per_page => $per_page )

SELECT * FROM "memos" WHERE ("memos"."user_id" = '2' AND "memos"."id" = '241') LIMIT 1
---
  def show
    @category = params[:category]
    @sub_category = params[:sub_category]
    @memo = Memo.find_by_id_and_user_id( params[:id], session[:user_id] )

SELECT * FROM "memos" WHERE ("memos"."user_id" = '2' AND "memos"."id" = '241') LIMIT 1
---
  def edit
    @category = params[:category]
    @sub_category = params[:sub_category]

    @memo = Memo.find_by_id_and_user_id( params[:id], session[:user_id] )

INSERT INTO "memos" ("sub_category", "created_at", "category", "title", "updated_at", "mode", "level", "user_id", "note") VALUES('TEST', '2010-11-03 05:17:11', 'Work', 'TEST', '2010-11-03 05:17:11', 'private', NULL, 2, 'テスト')
---
  def create

    @memo = Memo.new( params[:memo] )
    @category = @memo.category
    @sub_category = params[:sub_category]
    @memo.user_id = session[:user_id]

    if @memo.save

SELECT * FROM "memos" WHERE ("memos"."id" = 255)
UPDATE "memos" SET "updated_at" = '2011-02-11 09:03:41', "title" = 'てすと', "sub_category" = 'テスト' WHERE "id" = 1
---
  def update
    @memo = Memo.find( params[:id] )
    @category = params[:category]
    @sub_category = params[:sub_category]
    @memo.user_id = session[:user_id]

    update_params = params[:memo]
    update_params[:category] = "None" if update_params[:category].blank?

    if @memo.update_attributes( update_params )

SELECT * FROM "memos" WHERE ("memos"."user_id" = '2' AND "memos"."id" = '241') LIMIT 1
DELETE FROM "memos" WHERE "id" = 249
---
  def destroy
    @memo = Memo.find_by_id_and_user_id( params[:id], session[:user_id] )
    @category = params[:category]
    @sub_category = params[:sub_category]

    if !@memo.blank? and @memo.destroy