app/controllers/memos_controller.rb

  def search
    @search_word = params[:search_word]
    @search_type = params[:search_type]

    print "【 @search_word 】>> " ; p @search_word ;
    print "【 @search_type 】>> " ; p @search_type ;

    # メモ検索
    if @search_type == "note"
      @all_memos = Memo.all( :conditions => [ "note LIKE :search_word", { :search_word => "%#{@search_word}%" } ], :order => "category ASC, title ASC" )
---
SELECT * FROM "memos" WHERE (title LIKE '*' + '' + '*') ORDER BY category ASC, title ASC

  def show
    @category = params[:option]
    @memo = Memo.find( params[:id] )
---
SELECT * FROM "memos" WHERE ("memos"."id" = 19)

  def edit
    @category = params[:option]
    @memo = Memo.find( params[:id] )
---
SELECT * FROM "memos" WHERE ("memos"."id" = 241)

  def destroy
    @memo = Memo.find( params[:id] )
---
SELECT * FROM "memos" WHERE ("memos"."id" = 249)