app/controllers/public_controller.rb

  def list
    # セッションクリーニング
    session_clear()

    @category = params[:id]
    @search_word = params[:search_word]
    @search_type = params[:search_type]

    print "【 @category 】>> " ; p @category ;
    print "【 @search_word 】>> " ; p @search_word ;
    print "【 @search_type 】>> " ; p @search_type ;

    # 検索条件
#    conditions = Hash.new
#    conditions[:mode] = "public"
#    conditions[:category] = @category unless @category.blank?
    # 検索条件
    conditions_text = ""
    conditions_text += "mode = :mode"
    conditions_text += " AND category = :category" unless @category.blank?

    conditions = Hash.new
    conditions[:mode] = "public"
    conditions[:category] = @category unless @category.blank?

    # メモ検索
    if @search_type == "note"
      conditions_text += " AND note LIKE :search_word" unless @search_word.blank?
      conditions[:search_word] = "%#{@search_word}%" unless @search_word.blank?
      @all_public_memos = Memo.all( :conditions => [ conditions_text, conditions ], :order => "category ASC, title ASC" )
---
SELECT * FROM "memos" WHERE (mode = 'public' AND title LIKE '%テスト%') ORDER BY category ASC, title ASC

  def show
    @category = params[:option]
    @memo = Memo.find( params[:id] )
---
SELECT * FROM "memos" WHERE ("memos"."id" = 251)

  def search
    @search_word = params[:search_word]
    @search_type = params[:search_type]

    # 検索条件
    conditions_text = ""
    conditions_text += "mode = :mode"
    conditions_text += " AND category = :category" unless @category.blank?

    conditions = Hash.new
    conditions[:mode] = "public"
    conditions[:category] = @category unless @category.blank?
    conditions[:search_word] = "%#{@search_word}%"

    # メモ検索
    if @search_type == "note"
      conditions_text += " AND note LIKE :search_word"
      @all_public_memos = Memo.all( :conditions => [ conditions_text, conditions ], :order => "category ASC, title ASC" )
---
SELECT * FROM "memos" WHERE (title LIKE '%%' AND mode = 'public') ORDER BY category ASC, title ASC