app/controllers/users_controller.rb

  def create
    @user = User.new( params[:user] )
    @user.level = "user"

    if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "website_url", "hashed_password", "twitter_id", "birthday", "blog_url", "login_id", "password", "email") VALUES(NULL, '21631386400.149424072801212', '2010-07-04 05:47:35', '2010-07-04 05:47:35', NULL, '9db40eb474b1304e360263afe764e2ad16f79287', NULL, NULL, NULL, 'shu_0115', NULL, NULL)

  def login

    params_login = params[:login]

    session[:user_id] = nil

    if params_login.blank?
      flash[:notice] = "ログイン情報がありません。"
      redirect_to params[:request_url].to_s and return
    end

    if !params_login[:login_id].blank? and !params_login[:password].blank?
      # ユーザ認証
      user = User.authenticate( params_login[:login_id], params_login[:password] )

      unless user.blank?
---
SELECT * FROM "users" WHERE ("users"."login_id" = 'shu_0115') LIMIT 1

  def show
    @user = User.find( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def edit
    @user = User.find( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def update
    @user = User.find( session[:user_id] )

    if params[:user].blank?
      flash[:notice] = 'ユーザ情報がありません。'
      redirect_to :action => "edit", :id => @user.id
      return
    end

    # パスワードチェックがtrueで無ければ
    unless @user.password_check?( params[:user][:password] )
      flash[:notice] = '「現在のパスワード」が正しくありません。'
      redirect_to :action => "edit", :id => @user.id
      return
    end

    # ユーザ情報を更新
    if @user.update_attributes( params[:user] )
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-05 06:04:40', "salt" = '22069662000.139256520506627', "hashed_password" = '7054b44e7023a205768ac459b83653dcac8d9843', "twitter_id" = 'shu_0115' WHERE "id" = 2

  def edit_password
    @user = User.find( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1

  def update_password
    @user = User.find( session[:user_id] )
    params_user = params[:user]

    if params_user.blank?
      flash[:notice] = 'ユーザ情報がありません。'
      redirect_to :action => "edit_password", :id => @user.id
      return
    end

    # パスワードチェックがtrueで無ければ
    unless @user.password_check?( params_user[:password] )
      flash[:notice] = '「現在のパスワード」が正しくありません。'
      redirect_to :action => "edit_password", :id => @user.id
      return
    end

    # 変更するパスワードと再入力パスワードが一致しなければ
    unless params_user[:edit_password] == params_user[:password_confirmation]
      flash[:notice] = '「変更するパスワード」と「変更するパスワード(再入力)」が一致しません。'
      redirect_to :action => "edit_password", :id => @user.id
      return
    end

    # パスワード更新
    params_user[:password] = params_user[:edit_password]

    # ユーザ情報を更新
    if @user.update_attributes( params_user )
---
SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-12 03:49:19', "salt" = '21909222600.375834977021974', "hashed_password" = 'ef79e686a0a3f21f377355d10aae40e1a83cc377' WHERE "id" = 2